Examples/FvOptions/angleDuctWithSources/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

residualStart {
    type calcResidual;
    active true;
    selectionMode   all;

    calcResidualCoeffs {
        verbose true;
        doAddSup true;
        doSetValue true;
        fieldNames (
            U
            p
            h
            poroTime
            poroTime2
        );
    }
}

matrixBefore {
    type reportMatrix;
    active          true;
    selectionMode   all;

    reportMatrixCoeffs {
        fieldNames (
            U
            p
            h
            poroTime
            poroTime2
        );

       doAddSup true;
        doSetValue true;
   }
}

porosity1
{
    type            explicitPorositySource;
    active          true;
    selectionMode   cellZone;
    cellZone        porosity;

    explicitPorositySourceCoeffs
    {
        type            DarcyForchheimer;

        DarcyForchheimerCoeffs
        {
            d   d [0 -2 0 0 0 0 0] (5e7 -1000 -1000);
            f   f [0 -1 0 0 0 0 0] (0 0 0);

            coordinateSystem
            {
                type    cartesian;
                origin  (0 0 0);
                coordinateRotation
                {
                    type    axesRotation;
                    e1  (0.70710678 0.70710678 0);
                    e2  (0 0 1);
                }
            }
        }
    }
}

heatSource {
    type scalarSwakExplicitSource;
    active true;
    selectionMode cellZone;
    cellZone porosity;

    scalarSwakExplicitSourceCoeffs {
        variables (
            "htCoeff=1e6;"
        );
        expressions {
            h "pos().z<0 ? htCoeff*(400-T): 0" [1 -1 -3 0 0 0 0];
        }
    }
}

velFix {
    type vectorSwakSetValue;
    active false;
    selectionMode cellZone;
    cellZone porosity;

    vectorSwakSetValueCoeffs {
        useMaskExpression true;
        maskExpression "pos().z<0";

        expressions {
            U "vector(0,0,0)" [0 1 -1 0 0 0 0];
        }
    }
}

showFvOptions {
    type reportAvailableFvOptions;
    active true;
    selectionMode all;
    reportAvailableFvOptionsCoeffs {
    }
}

poroTimeSource {
    type scalarSwakExplicitSource;
    active true;
    selectionMode cellZone;
    cellZone porosity;

    scalarSwakExplicitSourceCoeffs {
         expressions {
            poroTime "1" [0 0 0 0 0 0 0];
        }
   }
}

poroTimeClear {
    type scalarSwakSetValue;
    active false;
    selectionMode cellZone;
    cellZone inlet;

    scalarSwakSetValueCoeffs {
        useMaskExpression true;

        maskExpression "pos().y<15e-3";
        expressions {
            poroTime "1" [0 0 1 0 0 0 0];
            poroTime2 $poroTime;
        }
    }
}

matrixAfter {
    $matrixBefore;
}

reportStuff {
    type executeFunctionObjectsFvOption;
    active true;
    selectionMode all;

    executeFunctionObjectsFvOptionCoeffs {
        fieldNames (
            U
            p
            k
            h
            epsilon
            phi
            T
        );

        verbose true;
        doCorrect true;
        doAddSup true;
        doSetValue true;
        doMakeRelative true;
        doMakeAbsolute true;

        functions {
            values {
                type volumeMinMax;
                verbose true;
                outputControlMode timeStep;
                outputInterval 1;

                fields (
                    p
                    U
                    k
                    epsilon
                    T
                );
            }
        }
    }
}

residualEnd {
    $residualStart;
}

//************************************************************************* //
